<?php

return [
    'success' => [
        'register' => ".تم إنشاء الحساب  بنجاح. يرجى التحقق من بريدك الإلكتروني لتفعيل الحساب",
        'login' => ".تم تسجيل الدخول بنجاح",
        'refresh' => ".تم تحديث الجلسة بنجاح",
        'logout' => ".تم تسجيل الخروج بنجاح",
        'email' => [
            'verified' => ".تم تأكيد البريد الالكتلروني بنجاح",
            'resend_verify' => ".تم إرسال بريد إلكتروني  للتأكيد. يرجى التحقق من بريدك الإلكتروني لتأكيد حسابك"
        ],
        'social' => [
            'register' => ".بنجاح :provider تم انشاء حساب جديد وربطه بحسابك على",
            'login' => ".بنجاح :provider تم تسجيل الدخول باستخدام",
        ],

    ],
    'error' => [
        'unauthorized' => ".غير مصرح: كلمة المرور أو البريد الإلكتروني غير صحيح",
        'email' => [
            'unverified' => ".يرجى تأكيد بريدك الإلكتروني. ثم تسجيل الدخول مرة أخرى",
            'unvalid_signature' => ".رابط التحقق منتهي الصلاحية. اطلب الرابط مجددا",
            'already_verified' => ".البريد الالكتروني مؤكد بالفعل",
            'many_attempts' => ".تجاوزت الحد الأقصى للمحاولات. يرجى الانتظار بضع دقائق قبل إعادة المحاولة"
        ],
        'token_expired' => ".انتهت جلستك. يرجى تسجيل الدخول مرة أخرى",
        'token_invalid' => ".جلستك غير صالحة. يرجى تسجيل الدخول مرة أخرى",
        'token_not_provided' => ".لم يتم العثور على جلسة صالحة. يرجى تسجيل الدخول للمتابعة",
        'unexpected_error' => ".حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى لاحقًا",
        'social' => [
            'email_or_name' => ".البريد الإلكتروني أو الاسم مفقود. يرجى التأكد من تفعيل أذونات البريد الإلكتروني والاسم في إعدادات حسابك الاجتماعي. ثم حاول مرة أخرى",
        ],
    ],
];
