<?php

return [
    'unexpected_error' => ".حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى لاحقًا",
    'user' => [
        'not_found' => ".المستخدم غير موجود",
        'not_found_index' => ".لم يتم العثور على أي مستخدم",
        'password_already_added' => ".تم إضافة كلمة السر بالفعل",
        'password_current_incorrect' => ".كلمة المرور الحالية غير صحيحة",
        'role_already_assigned' => ".هذا الدور تم تعيينه للمستخدم بالفعل",
    ],

    'notification' => [
        'not_found_unread_notification' => ".لم يتم العثور على هذا الإشعار الغير مقروء",
        'not_found_unread_notifications' => ".لم يتم العثور على إشعارات غير مقروءة",
    ],

    'room_type' => [
        'not_found_index_with_criteria' => ".لم يتم العثور على أنواع غرف تطابق المعايير المحددة",
        'not_found_index_trashed_with_criteria' => ".لم يتم العثور على أنواع غرف محذوفة تطابق المعايير المحددة",
        'not_found_index' => ".لم يتم العثور على أنواع غرف في الوقت الحالي",
        'not_found_index_trashed' =>  ".لم يتم العثور على أنواع غرف محذوفة",
        'not_found_favorite' => ".المفضلة لا تحوي على اي نوع من الغرف",
        'not_found' => ".نوع الغرفة غير موجود",
        'not_found_rooms' => ".لم يتم العثور على غرف تابعة لهذا النوع",
        'already_favorite' => ".تم إضافة نوع الغرفة إلى المفضلة بالفعل",
        'not_in_favorite' => ".نوع الغرفة ليس ضمن المفضلة",
        'has_rooms' => ".غير قادر على حذف نوع الغرفة قبل حذف جميع الغرف التي تنتمي إليها",
        'soft_delete' => ".غير قادر على حذف نوع الغرفة",
        'restore' => ".غير قادر على استعادة نوع الغرفة من الحذف",
        'force_delete' => ".غير قادر على حذف نوع الغرفة بشكل نهائي",
    ],

    'room' => [
        'not_found_index_with_criteria' => ".لم يتم العثور على غرف تطابق المعايير المحددة",
        'not_found_index_trashed_with_criteria' => ".لم يتم العثور على غرف محذوفة تطابق المعايير المحددة",
        'not_found_index' => ".لم يتم العثور على غرف في الوقت الحالي",
        'not_found_index_trashed' =>  ".لم يتم العثور على غرف محذوفة",
        'not_found_favorite' => ".المفضلة لا تحوي على أي غرفة",
        'not_found' => ".الغرفة غير موجودة",
        'already_favorite' => ".تم إضافة الغرفة إلى المفضلة بالفعل",
        'not_in_favorite' => ".الغرفة ليست ضمن المفضلة",
        'soft_delete' => ".غير قادر على حذف الغرفة",
        'restore' => ".غير قادر على استعادة الغرفة من الحذف",
        'force_delete' => ".غير قادر على حذف الغرفة بشكل نهائي",
    ],
];
