<?php

return [
    'email' => [
        'salutation' => "أطيب التمنيات",
        'greeting' => " مرحبا",
        'Thank_line' => ".شكرا لك على استخدام تطبيقنا",
        'verify_email' => [
            'subject' => ".تحقق من بريدك الالكتروني",
            'line1' => ".انقر فوق الزر أدناه للتحقق من عنوان بريدك الالكتروني",
            'action' => "أكد بريدك الالكتروني",
        ],
    ],

    'database' => [
        'email_updated' => ".تم تحديث بريدك الإلكتروني وتم إلغاء ربط حسابك مع وسائل التواصل الاجتماعي. يرجى تحديث بريدك الإلكتروني في حساباتك لإعادة ربطها",
    ],

];
