<?php

return [
    'user' => [
        'password_add' => ".تم إضافة كلمة السر إالى حسابك بنجاح",
        'password_update' => ".تم تحديث كلمة المرور بنجاح",
        'profile_update_with_email' => ".تم تحديث بيانات حسابك بنجاح. يُرجى التحقق من بريدك الإلكتروني الجديد لتأكيده. يُنصح أيضًا بتحديث البريد الإلكتروني في حسابات التواصل الاجتماعي المرتبطة",
        'profile_update' => ".تم تحديث بيانات حسابك بنجاح",
        'show_profile' => ".تم جلب تفاصيل البروفايل بنجاح",
        'show_user' => ".تم جلب تفاصيل المستخدم بنجاح",
        'index' => ".تم جلب تفاصيل جميع المستخدمين الذين تم تأكيد حساباتهم بنجاح",
        'role_assign' => ".تم تعيين الدور بنجاح",
    ],

    'notification' => [
        'get_all_notifications' => ".تم جلب كافة الإشعارات بنجاح",
        'get_unread_notifications' => ".تم جلب كافة الإشعارات الغير مقروءة بنجاح",
        'markAsRead' => ".تم قراءة الإشعار بنجاح",
        'markAllAsRead' => ".تم قراءة جميع الإشعارات بنجاح",
    ],

    'room_type' => [
        'index' => ".تم جلب أنواع الغرف بنجاح",
        'index_trashed' => ".تم جلب أنواع الغرف المحذوفة بنجاح",
        'show' => ".تم جلب نوع الغرفة بنجاح",
        'show_trashed' => ".تم جلب نوع الغرفة المحذوفة بنجاح",
        'rooms' => ".تم جلب جميع الغرف التابعة لهذا النوع بنجاح",
        'favorite' => ".تم جلب أنواع الغرف المفضلة بنجاح",
        'add_to_favorite' => ".تم إضافة نوع الغرفة إلى المفضلة بنجاح",
        'delete_from_favorite' => ".تم حذف نوع الغرفة من المفضلة بنجاح",
        'create' => ".تم إنشاء نوع غرفة جديد بنجاح",
        'update' => ".تم تحديث نوع الغرفة بنجاح",
        'soft_delete' => ".تم حذف نوع الغرفة بنجاح",
        'restore' => ".تم استعادة نوع الغرفة من الحذف بنجاح",
        'force_delete' => ".تم حذف نوع الغرفة بشكل نهائي بنجاح",
    ],

    'room' => [
        'index' => ".تم جلب الغرف بنجاح",
        'index_trashed' => ".تم جلب الغرف المحذوفة بنجاح",
        'show' => ".تم جلب الغرفة بنجاح",
        'show_trashed' => ".تم جلب الغرفة المحذوفة بنجاح",
        'favorite' => ".تم جلب الغرف المفضلة بنجاح",
        'add_to_favorite' => ".تم إضافة الغرفة إلى المفضلة بنجاح",
        'delete_from_favorite' => ".تم حذف الغرفة من المفضلة بنجاح",
        'create' => ".تم إنشاء غرفة جديدة بنجاح",
        'update' => ".تم تحديث الغرفة بنجاح",
        'soft_delete' => ".تم حذف الغرفة بنجاح",
        'restore' => ".تم استعادة الغرفة من الحذف بنجاح",
        'force_delete' => ".تم حذف الغرفة بشكل نهائي بنجاح",
    ],

    'service' => [
        'index' => ".تم جلب الخدمات بنجاح",
        'index_trashed' => ".تم جلب الخدمات المحذوفة بنجاح",
        'show' => ".تم جلب الخدمة بنجاح",
        'show_trashed' => ".تم جلب الخدمة المحذوفة بنجاح",
        'favorite' => ".تم جلب الخدمات المفضلة بنجاح",
        'add_to_favorite' => ".تم إضافة الخدمة إلى المفضلة بنجاح",
        'delete_from_favorite' => ".تم حذف الخدمة من المفضلة بنجاح",
        'create' => ".تم إنشاء خدمة جديدة بنجاح",
        'update' => ".تم تحديث الخدمة بنجاح",
        'soft_delete' => ".تم حذف الخدمة بنجاح",
        'restore' => ".تم استعادة الخدمة من الحذف بنجاح",
        'force_delete' => ".تم حذف الخدمة بشكل نهائي بنجاح",
    ],

    'room_type_service' => [
        'assign' => ".تم إسناد الخدمة إلى نوع الغرفة بنجاح",
        'revoke' => ".تم إلغاء الخدمة من نوع الغرفة بنجاح",
    ],
];
