<?php

return [
    'user' => [
        'password_add' => ".تم إضافة كلمة السر إالى حسابك بنجاح",
        'password_update' => ".تم تحديث كلمة المرور بنجاح",
        'profile_update_with_email' => ".تم تحديث بيانات حسابك بنجاح. يُرجى التحقق من بريدك الإلكتروني الجديد لتأكيده. يُنصح أيضًا بتحديث البريد الإلكتروني في حسابات التواصل الاجتماعي المرتبطة",
        'profile_update' => ".تم تحديث بيانات حسابك بنجاح",
        'show' => ".تم عرض معلومات المستخدم بنجاح",
    ],

    'notification' => [
        'get_all_notifications' => ".تم عرض كافة الإشعارات بنجاح",
        'get_unread_notifications' => ".تم عرض كافة الإشعارات الغير مقروءة بنجاح",
        'markAsRead' => ".تم قراءة الإشعار بنجاح",
        'markAllAsRead' => ".تم قراءة جميع الإشعارات بنجاح",
    ],

];
