<?php

return [
    'required' => ".هذاالحقل مطلوب",
    'string' => ".هذاالحقل يجب أن يكون نصًا",
    'email' => ".صحيح Gmail يجب أن يكون عنوان البريد الالكتروني",
    'min' => [
        'password' => ".محرف :min يجب أن تحتوي كلمة المرور على الأقل",
        'string' => ".محرف :min هذاالحقل يجب أن يحتوي على الأقل",
    ],

    'max' => [
        'password' => ".محرف :max يجب ألا تتجاوز كلمة المرور",
        'string' => ".محرف :max هذا الحقل يجب ألا يتجاوز",
    ],

    'unique' => [
        'email' => ".البريد الإلكتروني مستخدم بالفعل",
    ],

    'confirmed' => [
        'password' => ".يجب أن تتطابق كلمة المرور مع تأكيدها",
    ],

    'regex' => [
        'email' => ".(user@example.com :مثل) يرجى إدخال عنوان بريد إلكتروني صحيح بالصيغة المناسبة ",
        'password' => ".(+-*.@) :يجب أن تحتوي كلمة المرور على الأقل على حرف صغير، وحرف كبير، ورقم، وأحد الرموز التالية",
        'first_name' => ".يجب أن يبدأ الاسم الأول بحرف عربي أو إنجليزي. ويمكن أن يحتوي على أحرف عربية أو إنجليزية، أرقام، وشرطة سفلية",
        'last_name' => ".يجب أن يبدأ اسم العائلة بحرف عربي أو إنجليزي. ويمكن أن يحتوي على أحرف عربية أو إنجليزية، أرقام، وشرطة سفلية",
    ],

    'exists' => [
        'email' => ".البريد الإلكتروني المدخل غير موجود في سجلاتنا",
    ],

    'in' => [
        'role' => ".[user, admin, super_admin] :الدور يجب أن يكون واحد من التالي",
    ],
];
